int/resources/objectRepo/xmlTemplates/ows/OWSReservation/req_FetchBooking.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:res="http://webservices.micros.com/ows/5.1/Reservation.wsdl" xmlns:res1="http://webservices.micros.com/og/4.3/Reservation/">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="true" primaryLangID="E" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <res:FetchBookingRequest canHandleVaultedCreditCard="?">
         <res:HotelReference chainCode="?" hotelCode="?"/>
         <res:ConfirmationNumber source="?" type="?"/>
         <res:GDSID source="?" type="?"/>
         <res:LegNumber source="?" type="?"/>
         <res:CustomReference source="?" type="?"/>
         <res:ExternalSystemNumber>
            <res1:ReferenceNumber/>
            <res1:LegNumber/>
            <res1:ReferenceType/>
         </res:ExternalSystemNumber>
         <res:ResvNameId source="?" type="?"/>
         <res:KeyTrack Key1Track="?" Key2Track="?" Key3Track="?" Key4Track="?"/>
      </res:FetchBookingRequest>
   </soapenv:Body>
</soapenv:Envelope>